       01  ACCOUNT-RECORD.
           05 ACCT-ID              PIC X(06).
           05 ACCT-NAME            PIC X(24).
           05 ACCT-BALANCE         PIC S9(09)V99.
