       01  TRANSACTION-RECORD.
           05 TXN-ACCT-ID          PIC X(06).
           05 TXN-CODE             PIC X(03).
           05 TXN-AMOUNT           PIC S9(07)V99.
