//SORTJOB  JOB (ACCT),'SORT DEMO',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//SORTSTEP EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DISP=SHR,DSN=&SYSUID..INPUT.TRANSACT
//SORTOUT  DD DISP=SHR,DSN=&SYSUID..OUTPUT.TRANSACT
//SYSIN    DD *
  SORT FIELDS=(1,6,CH,A,10,9,ZD,D)
/*
